УправлениеИТФирмой_First/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЮридическийАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПочтовыйАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Программы</name>
    <attributes>
      <name>Программа</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УправлениеИТФирмой_First/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <predefined>
    <items>
      <name>EMailКонтрагента</name>
      <description>EMailКонтрагента</description>
    </items>
    <items>
      <name>ПочтовыйАдресКонтрагента</name>
      <description>ПочтовыйАдресКонтрагента</description>
    </items>
    <items>
      <name>ТелефонКонтрагента</name>
      <description>ТелефонКонтрагента</description>
    </items>
    <items>
      <name>ФактическийАдресКонтрагента</name>
      <description>ФактическийАдресКонтрагента</description>
    </items>
    <items>
      <name>ЮридическийАдресКонтрагента</name>
      <description>ЮридическийАдресКонтрагента</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
</mdclass:Catalog>

УправлениеИТФирмой_First/src/Catalogs/Контрагенты/ManagerModule.bsl
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка) 
	
	Поля.Добавить("УдалитьЮридическийАдрес");
	Поля.Добавить("УдалитьПочтовыйАдрес");
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = СтрШаблон("%1-%2", Данные.УдалитьЮридическийАдрес, Данные.УдалитьПочтовыйАдрес); 
	
КонецПроцедуры 

Процедура ЗаполнитьТабличнуюЧастьКонтактнаяИнформация() Экспорт

	Выборка = Справочники.Контрагенты.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		КонтрагентОбъект = Выборка.ПолучитьОбъект();
		Строка = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
		Строка.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента;
		Строка.Значение = КонтрагентОбъект.УдалитьПочтовыйАдрес;
		
		Строка = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
		Строка.Вид = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента;
		Строка.Значение = КонтрагентОбъект.УдалитьЮридическийАдрес;	
			
		КонтрагентОбъект.Записать();
	КонецЦикла;
	 
	
КонецПроцедуры
